w7d4/app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "4"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 4]]
SELECT "feeds".* FROM "feeds"
---
  def destroy
    feed = Feed.find(params[:id])
    feed.destroy!

    render :json => Feed.all