w7d4/app/controllers/api/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save

SELECT "users".* FROM "users"
---
  def index
    render :json => User.all